In [12]:
import pandas as pd
cities = {"name": ["London", "Berlin", "Madrid", "Rome",
"Paris", "Vienna", "Bucharest", "Hamburg",
"Budapest", "Warsaw", "Barcelona",
"Munich", "Milan"],
"population": [8615246, 3562166, 3165235, 2874038,
2273305, 1805681, 1803425, 1760433,
1754000, 1740119, 1602386, 1493900,
1350680],
"country": ["England", "Germany", "Spain", "Italy",
"France", "Austria", "Romania",
"Germany", "Hungary", "Poland", "Spain",
"Germany", "Italy"]}

city_frame = pd.DataFrame(cities)
city_frame

         name  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

# REARRANGING THE ORDER OF COLUMNS
We can also define and rearrange the order of the columns at the time of creation of the DataFrame. This
makes also sure that we will have a defined ordering of our columns, if we create the DataFrame from a dictionary. Dictionaries are not ordered, so we cannot know in advance what the ordering of our columns will be. We change both the column order and the ordering of the index with the function reindex with the
following code:

In [13]:
city_frame.reindex(columns=['country', 'name', 'population'])

    country       name  population
0   England     London     8615246
1   Germany     Berlin     3562166
2     Spain     Madrid     3165235
3     Italy       Rome     2874038
4    France      Paris     2273305
5   Austria     Vienna     1805681
6   Romania  Bucharest     1803425
7   Germany    Hamburg     1760433
8   Hungary   Budapest     1754000
9    Poland     Warsaw     1740119
10    Spain  Barcelona     1602386
11  Germany     Munich     1493900
12    Italy      Milan     1350680

In [3]:
#row index
city_frame.reindex(index=[0, 2, 4, 6, 8, 10, 12, 1, 3, 5, 7, 9, 11])

         name  population  country
0      London     8615246  England
2      Madrid     3165235    Spain
4       Paris     2273305   France
6   Bucharest     1803425  Romania
8    Budapest     1754000  Hungary
10  Barcelona     1602386    Spain
12      Milan     1350680    Italy
1      Berlin     3562166  Germany
3        Rome     2874038    Italy
5      Vienna     1805681  Austria
7     Hamburg     1760433  Germany
9      Warsaw     1740119   Poland
11     Munich     1493900  Germany

In [4]:
#both in one go
city_frame.reindex(index=[0, 2, 4, 6, 8, 10, 12, 1, 3, 5, 7, 9, 11],columns=['country', 'name', 'population'])

    country       name  population
0   England     London     8615246
2     Spain     Madrid     3165235
4    France      Paris     2273305
6   Romania  Bucharest     1803425
8   Hungary   Budapest     1754000
10    Spain  Barcelona     1602386
12    Italy      Milan     1350680
1   Germany     Berlin     3562166
3     Italy       Rome     2874038
5   Austria     Vienna     1805681
7   Germany    Hamburg     1760433
9    Poland     Warsaw     1740119
11  Germany     Munich     1493900

# Renaming columns

In [5]:
city_frame.rename(columns={"name":"Naam","country":"Desh","population":"Jansankhya"},inplace=True)
city_frame

         Naam  Jansankhya     Desh
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

# CUSTOM INDEX
We can see that an index (0,1,2, ...) has been automatically assigned to the DataFrame. We can also assign a custom index to the DataFrame object:

In [6]:
city_frame2 = city_frame.set_index("Desh") # will create new frame
print(city_frame2)

              Naam  Jansankhya
Desh
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [7]:
# if you want to change the existing then use inplace=True
# city_frame.set_index("Desh", inplace=True)

# ACCESSING ROWS VIA INDEX VALUES

Till now we have accessed DataFrames via the columns. It is often necessary to select certain rows via the index
names. We will demonstrate now, how we can access rows from DataFrames via the locators 'loc' and 'iloc'.
We will not cover 'ix' because it is deprecated and will be removed in the future.We select all the German cities in the following example by using 'loc'. The result is a DataFrame:

In [14]:
city_frame3 = pd.DataFrame(cities, columns=("name", "population"),index=cities["country"])
print(city_frame3)

              name  population
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [15]:
print(city_frame3.loc["Germany"])

            name  population
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900

It is also possible to simultaneously extracting rows by chosen more than on index labels. To do this we use a
list of indices:

In [17]:
print(city_frame3.loc[["Germany", "France"]])

            name  population
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900
France     Paris     2273305

We will also need to select pandas DataFrame rows based on conditions, which are applied to column values.
We can use the operators '>', '=', '=', '<=', '!=' for this purpose. We select all cities with a population of more
than two million in the following example:

In [18]:
condition = city_frame3.population>2000000
condition

England     True
Germany     True
Spain       True
Italy       True
France      True
Austria    False
Romania    False
Germany    False
Hungary    False
Poland     False
Spain      False
Germany    False
Italy      False
Name: population, dtype: bool

We can use this Boolean DataFrame condition with loc to finally create the selection:

In [ ]:
print(city_frame.loc[condition])

It is also possible to logically combine more than one condition with & and | :

In [ ]:
condition1 = (city_frame.population>1500000)
condition2 = (city_frame['name'].str.contains("m"))
print(city_frame.loc[condition1 & condition2])

We use a logical or | in the following example to see all cities of the Pandas DataFrame, where either the
city name contains the letter 'm' or the population number is greater than three million:

In [ ]:
condition1 = (city_frame.population>3000000)
condition2 = (city_frame['name'].str.contains("m"))
print(city_frame.loc[condition1 | condition2])

# ADDING ROWS TO A DATAFRAME

In [ ]:
milan = ['Milan', 1399860]
city_frame.iloc[-1] = milan
city_frame.loc['Italy'] = ['Zurich', 415215]
city_frame

# ACCESSING ROWS BY POSITION
The iloc method of a Pandas DataFrame object can be used to select rows and columns by number, i.e. in
the order that they appear in the data frame. iloc allows selections of the rows, as if they were numbered
by integers 0 , 1 , 2 , ....
We demonstrate this in the following example:

In [19]:
df = city_frame.iloc[3]
print(df)

name             Rome
population    2874038
country         Italy
Name: 3, dtype: object

To get a DataFrame with selected rows by numbers, we use a list of integers. We can see that we can change
the order of the rows and we are also able to select rows multiple times:

In [20]:
df = city_frame.iloc[[3, 2, 0, 5, 0]]
print(df)

     name  population  country
3    Rome     2874038    Italy
2  Madrid     3165235    Spain
0  London     8615246  England
5  Vienna     1805681  Austria
0  London     8615246  England

# SUM AND CUMULATIVE SUM
The DataFrame object of Pandas provides a method to sum both columns and rows. Before we will explain the
usage of the sum method, we will create a new DataFrame object on which we will apply our examples. We
will start by creating an empty DataFrame without columns but an index. We populate this DataFrame by
adding columns with random values:

In [21]:
import numpy as np
years = range(2014, 2019)
cities = ["Zürich", "Freiburg", "München", "Konstanz", "Saarbrücken"]
shops = pd.DataFrame(index=years)
for city in cities:
    shops.insert(loc=len(shops.columns),column=city,value=(np.random.uniform(0.7, 1, (5,)) * 1000).round(2))
print(shops)

      Zürich  Freiburg  München  Konstanz  Saarbrücken
2014  955.50    766.31   982.54    842.34       991.42
2015  864.02    865.81   810.25    979.92       901.85
2016  792.35    802.00   965.54    852.36       760.76
2017  940.47    758.00   925.67    707.08       771.19
2018  851.85    937.15   825.68    892.62       906.37

Let's apply sum to the DataFrame shops :

In [22]:
shops.sum()

Zürich         4404.19
Freiburg       4129.27
München        4509.68
Konstanz       4274.32
Saarbrücken    4331.59
dtype: float64

We can see that it summed up all the columns of our DataFrame. What about calculating the sum of the rows?
We can do this by using the axis parameter of sum .

In [23]:
shops.sum(axis=1)

2014    4538.11
2015    4421.85
2016    4173.01
2017    4102.41
2018    4413.67
dtype: float64

# Assignment Question: You only want to the the sums for the first, third and the last column and for all the years:

We can use "cumsum" to calculate the cumulative sum over the years:

In [24]:
x = shops.cumsum()
print(x)

       Zürich  Freiburg  München  Konstanz  Saarbrücken
2014   955.50    766.31   982.54    842.34       991.42
2015  1819.52   1632.12  1792.79   1822.26      1893.27
2016  2611.87   2434.12  2758.33   2674.62      2654.03
2017  3552.34   3192.12  3684.00   3381.70      3425.22
2018  4404.19   4129.27  4509.68   4274.32      4331.59

Using the keyword parameter axis with the value 1, we can build the cumulative sum over the rows:

In [28]:
x = shops.cumsum(axis=1)
print(x)
city_frame

      Zürich  Freiburg  München  Konstanz  Saarbrücken
2014  955.50   1721.81  2704.35   3546.69      4538.11
2015  864.02   1729.83  2540.08   3520.00      4421.85
2016  792.35   1594.35  2559.89   3412.25      4173.01
2017  940.47   1698.47  2624.14   3331.22      4102.41
2018  851.85   1789.00  2614.68   3507.30      4413.67

         name  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

# ASSIGNING NEW VALUES TO COLUMNS
x is a Pandas Series. We can reassign the previously calculated cumulative sums to the population column:

In [29]:
x=[12,34,4,4,4,4,4,4,4,4,4,4,4]
city_frame["population"] = x
print(city_frame)

         name  population  country
0      London          12  England
1      Berlin          34  Germany
2      Madrid           4    Spain
3        Rome           4    Italy
4       Paris           4   France
5      Vienna           4  Austria
6   Bucharest           4  Romania
7     Hamburg           4  Germany
8    Budapest           4  Hungary
9      Warsaw           4   Poland
10  Barcelona           4    Spain
11     Munich           4  Germany
12      Milan           4    Italy

Instead of replacing the values of the population column with the cumulative sum, we want to add the
cumulative population sum as a new culumn with the name "cum_population".

In [ ]:
city_frame["cum_population"] = city_frame["population"].cumsum()
city_frame